package cn.myphoenix;

/**
 * @author: larry_lwh
 * @date: 2024-11-29 20:25
 * @description: 球类运动
 **/
public class BallSports {

    public void playBasketBall() {
        System.out.println("彼时的少年，站在成长的巅峰，回首来时，满路崎岖，早已鲜花盛开。当哈利波顿第一次见证他的偶像勒布朗·詹姆斯夺冠时，他还只是一个在自己家客厅里站着观看比赛的孩子。而现在，两人各为其主，这不仅是篮球的故事，也是成长的故事。");
    }

    public void playFootBall() {
        System.out.println("西班牙球员们尽管赢球但是心情依旧比较沮丧，但是他们完全不应为此感到抱歉。因为他们已经到过很多人永远无法企及的高度。作为他们的球迷当然是得到满足还会想要更多的满足，这无可厚非，但是这种要求并不实际，因为自古打天下难，守天下更难，没有人可以永远站在顶峰。即使可以做到居安思危未雨绸缪，但是你身边全都是和你一样充满野心、充满激情和充满渴望的年轻人，他们可以把你的长处和短处放在显微镜下去研究，以你为标靶，你说守天下难不难？人生当中成功只是一时的，失败却是主旋律，但是如何面对失败却把人分成了不同的样子。有的人会被失败击垮，有的人会不断爬起来继续向前，澳大利亚队是如此，西班牙队也是如此。我想真正的成熟应该并不是追求完美，而是直面自己的缺憾，这才是生活的本质。罗曼-罗兰说过：‘这个世界上只有一种真正的英雄主义，那就是认清生活的真相并且仍然热爱它。’西班牙队重头再来吧，难道向上攀爬的那条路不是比站在顶峰更令人热血澎湃吗？相信拉莫斯他们还有更多的机会，就是这样。观众朋友们，再见。");
    }
}
